from collections import Counter

text = """Շուրջ 70 մեթր բարձրութենէն Արփայի կիրճը գահավիժող բնութեան այս հրաշալիքը, որ թափած վարսեր կը յիշեցնէ, ժողովուրդը անուանած է «ջրահարսի վարսեր» եւ անոր մասին հիւսած է երկրորդ աւանդութիւն մը։
Ժամանակին, այսօրուան ջրվէժին տեղ, անդնդախոր ժայռերու ծերպին կը գտնուէր իշխանի մը ամրոցը, որ ունէր գեղեցկուհի դուստր մը։ Իշխանուհիին ձեռքը խնդրելու կու գային աշխարհի տարբեր ծայրերէն, սակայն ան կը մերժէր բոլորը, որովհետեւ իր սիրտը կը պատկանէր հովիւի մը երիտասարդ, քաջարի ու գեղեցիկ որդւոյն։ Ամէն օր, կէս գիշերէն ետք, ամրոցին իր ննջարանին լուսամուտէն դեռատի իշխանուհին դէպի ձոր կը նետէր երկար պարանի մը ծայրը, որմով հովիւին որդին խոր կիրճէն կը բարձրանար սիրեցեալին քով։
Իշխանը շուտով կը տեղեկանայ՝ կը զայրանայ եւ կ'անիծէ դուստրը. եթէ անգամ մըն ալ հանդիպի հովիւին որդւոյն, թող ջրահարս դառնայ ու ջուրէն երբեք դուրս չգայ։ Սակայն դեռատի սիրահարներուն ոչինչ արգելք կը հանդիսանայ. գեղեցկուհին պարանի փոխարէն ժայռին բարձունքէն կը կախէ իր երկար ու գեղեցիկ վարսերը։ Սակայն նոյն ակնթարթին կը կատարուի հօր դաժան անէծքը. գեղեցկուհին կը դառնայ ջրահարս, իսկ կիրճ թափող անոր գեղեցիկ վարսերը կը դառնան հրաշագեղ ջրվէժ մը, զորս ժողովուրդը կ'անուանէ «ջրահարսի վարսեր»"""

letter_counts = Counter(text)
letters = set([l for l in text])
print(dict(sorted(letter_counts.items(), key=lambda item: item[1])))
